using System;
using System.Collections.Generic;
using DynamicData;
using Marsey.Patches;
using Marsey.Subversion;
using Splat;
using SS14.Launcher.Models.Data;
using SS14.Launcher.Utility;

namespace SS14.Launcher.Marseyverse;

public class TitleCondition
{
    public required Func<bool> Condition { get; set; }
    public required string Message { get; set; }
}

public class TitleManager
{
    private const string BanMessage = "Забанен";
    private static readonly Random Random = new Random();

    public TitleManager()
    {
        DataManager cfg = Locator.Current.GetRequiredService<DataManager>(); // Thanks for inspiration.gif
        if (!cfg.GetCVar(CVars.RandTitle))
        {
            RandomTitle = LauncherVersion.Name;
            return;
        }

        List<TitleCondition> titleConditions = new List<TitleCondition>
        {
            new TitleCondition { Condition = () => OperatingSystem.IsWindows(), Message = "if (OperatingSystem.IsWindows()" },
            new TitleCondition { Condition = () => Subverter.GetSubverterPatches().Count > 5, Message = "Subversion is superior to git you know" },
            new TitleCondition { Condition = () => Marsyfier.GetMarseyPatches().Count > 10, Message = "Marsyfiedisms" },
            new TitleCondition { Condition = () => cfg.GetCVar(CVars.FakeRPC), Message = $"{CVars.RPCUsername} RP" }
        };

        foreach (TitleCondition condition in titleConditions)
        {
            if (condition.Condition())
                TagLines.Add(condition.Message);
        }

        string name = RandTitle();
        string tagline = "";

        if (name == BanMessage)
            tagline = RandBanReason();
        else
            tagline = RandTagLine();

        RandomTitle = name + ": " + tagline;
    }

    private static readonly List<string> Titles =
    [
        "Лаунчер Space Station 14", "Драмалаунчер",
        "Марси", "Мунливэйр", "Марсилоадер",
        "Робастконтроль", "Мирайлоадер", "Почти BepInEx",
        "Лаунчер для видеоигр", "Сертифицировано MIT как смешное",
        "ЭДсЛи пидор ебаный", "ЭДсЛи иди нахуй", "Старейший анархичный лаунчер в SS14",
        "ILVerifier", "Space Station 13", "BYOND",
        "Гунстэйшн", "BYONDCONTROL", "Юнитистэйшн",
        "Стейшнерс", "RE:SS2D", "Шизостэйшн 14",
        "Таумотравма", "Каламати v3",
        "Шпионское ПО Синдиката (Легальная Версия)", "БВОИНК Лаунчер",
        "Робастификатор 9000", "Симулятор Каргонии", "Макскап Эксплозив 14",
        "BYOND, но лучше", "ЯщероЛоадер 14", "Рай Шизопостеров",
        "Грифстэйшн 14",
        "Фирменный лаунчер НаноТрейзен (Теперь на 200% робастнее)", BanMessage
    ];

    private static readonly List<string> TagLines =
    [
        "Марси — самый милый котик", "Не читерский лоадер",
        "Решения для самовольного мержа PR", "RSHOE пожалуйста вернись",
        "Сегодня я узнал что RSHOE — это дате, теперь всё кончено",
        "Как подтверждено на discord.gg/ss14", "Ведущий отключитель проверок сигнатур движка",
        "Зигмунд Голдберг умер за это", "Симулятор обхода сандбокса", "Гайды по созданию бомб своими руками",
        "Сервис знакомств для инцелов", "Первый поставщик ransomware-программ", "Читер",
        "Маёцид приближается", "Главный форум мисандристов", "Права трансам! На сожжение в крематории.",
        "Крупнейший поставщик больших шарфов", "ЭДсЛи ты пидор", "Тестер говнокода",
        "Клиентский код буквально называет себя читерским клиентом",
        "Тумблр-клиент для фуджоши", "Дешёвые авиабилеты и отели", "Консалтинг по алии",
        "Менеджер модов для Friday Night Funkin", "Скачать .apk MOD (Бесконечные деньги, здоровье, бесплатный админ)",
        "Генератор катастроф", "Основная причина споров о бинарных блобах",
        "Джордж Буш сделал 9/11, а я почему-то плохой парень", "Группа поддержки гибристофиликов",
        "Космическая игра, но крутая", "Игра ОТСТОЙ, я спать", "Иди иронизируй на wizden",
        "На зарплате у саудовского правительства", "Разбираюсь с читерами с ноября",
        "Античит мирового класса", "Основная причина вторичного психоза",
        "они даже сделали это для fastnoiselite, что говорит мне о повреждении мозга у некоторых людей",
        "Объявление на станции: Buttfucker69 (Мед. интерн) прибыл на станцию!",
        "Игра ещё не вышла, но уже 7000+ банаппилов"
    ];

    // Have I truly lost any imagination? Yeah, kind of.
    private static readonly List<string> BanReasons =
    [
        "Использование модифицированного клиента", "Селф-антаг", "Обход бана", "Датацентр",
        "Зеркальный бан с nyano", "VAC-бан на secure сервере", "Неприятен в общении на гитхабе и в игре",
        "В роли CMO участвовал в RP с рабством", "Вышел через секунду после получения ахелпа", "Называл себя Гитлером ямайского джаза",
        "иди нахуй, больной ублюдок", "ГРУГШТЕЙН", "Альт", "Взорвал сваркой группу секьюрити", "Выгуливал сварочный резервуар",
        "Рейдер", "Массово убивал людей палкой-потрошителем из подарка", "Постоянный селф-антаг и грифф отдела безопасности",
        "Подарил вардену моба-курицу, назвав её 'BBC'", "Культист. Можно подать апел через 6 месяцев.", "Буквально имеет 20+ аккаунтов.",
        "лайкнул трансфобный пост в твиттере", "RP в стиле 'качки избивают (убивают) ботаников (5) и засовывают их в шкафы'",
        "Персонаж по имени 'АДОЛЬФ РИЗЛЕР'", "написал на бумажке 'я обоссался'", "Полная некомпетентность в роли капитана",
        "Раздавал AA-ID", "Быть swept", "Быть кармой", "обучал людей изготовлению наркотиков 1-й категории", "RP Гитлера в карго-заказах",
        "Продажа ядерки", "Намеренно создавал комнату с миазмой", "Выставил AME на 140 и отключился",
        "Эксплоиты. Телепортировался в оружейку с помощью стульев.", "рекордсмен по speedrun пермабана по правилу 0", "Отдохни, дружок",
        "Пермабан без права апелляции по рекомендации игроков и хостов", "Метакоммы", "'мягкий антаг ролл', павергейминг, хамство в OOC",
        "Многократные предупреждения за павергейминг в антаг-ролях", "был уличен в 'мягком антаг ролле'", "сделал уборщика фурри против его воли",
        "проявлял нездоровую вовлеченность в раунды, согласно OOC/deadchat", "Масс-RDM. Убил 31 человека с помощью электрических решеток",
        "Открыто хвастался своим мудачеством", "Кидать фейковые порно-ссылки - не смешно", "3 бана за 6 месяцев - порог",
        "факторы, указывающие на внимание-seeking поведение", "35 минут только и делал, что плазмобомбил медбей",
        "просил людей станцевать тряску булок"
    ];

    private static readonly List<string> Actions =
    [
        "Закачка веселящего газа в дистру", "Заливка плазмы в батареи", "Слип-наручники на ХОСа", "Основание культа", "Ролл на антага",
        "Плазмозатопление станции", "Провозглашение Каргонии", "Уклонение от банов", "Прогулка с топливными баками", "Гиббинг без причины",
        "Буллинг триалминов", "ГРОМКО ЗАЯВЛЯЮ О СВОЁМ ПРИСУТСТВИИ", "Гладить Марси", "Сплетни о космических драмках", "Портирование /vg/ на 14",
        "Выдача +HOST", "Игра на балалайке", "Аниме после 2018 - помойка", "Торговля нефтью", "Злоупотребление Роскомнадзором", "Троллинг людей в мастодоне",
        "Взлом энергосети", "Свержение капитана", "Сборка меха", "Написание законов ИИ", "Диагностика двигателя",
        "Апгрейд медбея", "Охрана оружейки", "Ремонт пробоин в корпусе", "Исследования в ксенобио", "Исследование лаваленда",
        "Добыча плазмы", "Крафт самопальных снарядов", "Настройка СМ", "Прорыв в охраняемые зоны", "Бои с оперативниками Синдиката",
        "Побег на шаттле", "Воскрешение мёртвых членов экипажа", "Клонирование клоуна", "Захапка запасного ID капитана", "Саботаж телекоммов",
        "Проникновение в оружейку через мусоропровод", "Эксплуатация механики таскания"
    ];

    public string RandomTitle { get; }

    public static string RandTitle() => Titles[Random.Next(Titles.Count)];
    public static string RandTagLine() => TagLines[Random.Next(TagLines.Count)];
    public static string RandBanReason() => BanReasons[Random.Next(BanReasons.Count)];
    public static string RandAction() => Actions[Random.Next(Actions.Count)];
}
